---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Clear
source: html/3e907223-e8c2-a8b0-0031-53cd7befab06.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Clear Method

Removes every MEPBuildingConstruction from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```